Updated ARCHITECTURE.md
